### Topics Cover:
- lower, upper, title, len
- Replace( )
- Strip, lstrip, rstrip
- split
- paramters of str.split()

In [1]:
import pandas as pd

Import the chicago.csv and convert the department into a category since there are only a few unique values.

In [12]:
# drop the last row on import which is all null
chicago = pd.read_csv('../datasets/chicago.csv').dropna(how="all")

# create category for memory optimization
chicago["Department"] = chicago["Department"].astype('category')
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

lower( ) and upper( ) are very intuitive. The do as they state: lower creates a string that is all lower case and uppper to upper case. This is often handy for consistency across the data set.

In [3]:
# examples
"TO LOWER".lower()

"to upper".upper()

'TO UPPER'

In [4]:
# using title is also intuitive, it capitalizes every word using a space as an indicator (space is the default)
"my title is now a proper case".title()

'My Title Is Now A Proper Case'

In [5]:
# len( ) tells us the number of characters in the string. We pass as tring or var into it. Notice the space is counted below.
len("how long is the string?")

23

#### Whenver we call a string method in pandas, we have to prefix our method with a .str.method( )

In [6]:
# example: apply title to Name for proper casing. Remember, its needs to be reassigned ot be applied to the df.
chicago['Position Title'] = chicago['Position Title'].str.title()

chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  Water Rate Taker  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    Police Officer       POLICE              $84450.00
2     AARON,  KARINA    Police Officer       POLICE              $84450.00

### Get the length of each var in a row

In [7]:
# department len
chicago["Department"].str.len()

0        11.0
1         6.0
2         6.0
3        16.0
4        11.0
         ...
32058     6.0
32059     6.0
32060     6.0
32061     4.0
32062     NaN
Name: Department, Length: 32063, dtype: float64

### The str.replace( ) method
- take 2 arguements: 1. the character to replace 2.the character we choose to replace with.
- example: we want to replace the comma with a dash, replace("," , "-")

In [10]:
# example, replace the empty space with a dash
"replace this empty space.".replace(" ", "-")

'replace-this-empty-space.'

### Replace the MGMNT in the department variable with the full name of "Management".
- To reassign use an assignment to the variable.

In [14]:
# series example
chicago['Department'].str.replace("MGMNT", "MANAGEMENT")

0        WATER MANAGEMENT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4        WATER MANAGEMENT
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: object

In [15]:
# reassign the variable
chicago['Department'] = chicago['Department'].str.replace("MGMNT", "MANAGEMENT")

chicago.head(1)

              Name    Position Title        Department Employee Annual Salary
0  AARON,  ELVIA J  WATER RATE TAKER  WATER MANAGEMENT              $90744.00

### Take the Employees Annual Salary varibale and remove the dollar sign.
- for numeric columns with a dollar sign or any special type cgharacter, the column is a string. We cannot use math functions like sum or avergae on them so we need to remove it and convert to float or int.

- Remember that on import we dropped the null rows. Whenver there is a null row, Pandas will by default convert that column to a floating point value. Iin this case, it appears as a floating point but it is a string.

In [20]:
# replace the dollar sign with nothing ot an empty string ""
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype('float')

chicago.head(3)

<ipython-input-20-f129112ec1b7>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype('float')

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0

In [24]:
# take the average salary by position title
round(chicago.groupby("Position Title").mean("Employee Annual Salary"), 2)

                              Employee Annual Salary
Position Title
1ST DEPUTY INSPECTOR GENERAL               137052.00
A/MGR COM SVC-ELECTIONS                    100812.00
A/MGR OF MIS-ELECTIONS                      94932.00
A/MGR WAREHOUSE-ELECTIONS                   73152.00
A/SUPRV REDISTRICTING                       57642.00
...                                              ...
WINDOW WASHER                               47320.00
YOUTH SERVICES COORD                        74686.29
ZONING ADMINISTRATOR                       139800.00
ZONING INVESTIGATOR                         99552.00
ZONING PLAN EXAMINER                        60069.00

[1093 rows x 1 columns]

In [28]:
# get the top 3 salaries 
chicago["Employee Annual Salary"].nlargest(3)

8184     300000.0
7954     216210.0
25532    202728.0
Name: Employee Annual Salary, dtype: float64

### Filtering with string methods - contains( )
- Produces a boolean series
- Filter for a position tile that contains the word "water". It doesnt mattr where it occurs only that the title contains it  for consistency, use lower or upper to normalize the series when running a search that contains a word becasue A is not the same as a. 
- Every method must have and str prefix when method chaining

In [30]:
chicago['Position Title'].str.lower().str.contains("water")

0         True
1        False
2        False
3        False
4        False
         ...
32057    False
32058    False
32059    False
32060    False
32061    False
Name: Position Title, Length: 32062, dtype: bool

In [32]:
# to see only the Position Title rows that contain the word "water" use a mask varibale then call it
mask = chicago['Position Title'].str.lower().str.contains("water")

chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,82044.0
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MANAGEMENT,109272.0
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0

#### Starts with and ends with string method
- Starts with looks at the begining of the string.
- Ends with looks at the end of the string.

In [33]:
# Look for the word water in Position Title at the very begining.
mask = chicago['Position Title'].str.lower().str.startswith("water")

chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1054,"ASHLEY, KARMA T",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1079,"ATKINS, JOANNA M",WATER CHEMIST II,WATER MANAGEMENT,82044.0
1181,"AZEEM, MOHAMMED A",WATER CHEMIST II,WATER MANAGEMENT,53172.0

In [36]:
# ends with "ist"
mask = chicago['Position Title'].str.lower().str.endswith("ist")

chicago[mask].head()

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",PSYCHIATRIST,HEALTH,99840.0
308,"ALARCON, LUIS J",LOAN PROCESSING SPECIALIST,COMMUNITY DEVELOPMENT,81948.0
422,"ALLAIN, CAROLYN",SENIOR TELECOMMUNICATIONS SPECIALIST,DoIT,89880.0
472,"ALLEN, ROBERT",MACHINIST,WATER MANAGEMENT,94328.0
705,"ANDERSON, EDWARD M",SR PROCUREMENT SPECIALIST,PROCUREMENT,91476.0

### strip( ), lstrip( ) & rstrip( )
- all are used to remove whitespace in a variable.
- whitespace can osscur on both sides, only hte right side or only the left side hence the variations above.

In [39]:
# example of lstrip( )
"    whitespace left   "

'    whitespace left   '

In [41]:
# strip the whitespace, notice the right side still has whitespace, the same can used with rstrip()
"    whitespace left   ".lstrip()

'whitespace left   '

In [42]:
# when there is whitespace on both side, use strip( )
"    whitespace is now gone    ".strip()

'whitespace is now gone'

In [43]:
# strip whitespace from the Name column
chicago["Name"] = chicago["Name"].str.strip()

chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,84450.0
2,"AARON, KARINA",POLICE OFFICER,POLICE,84450.0

### Split strings by character with split( )
- splits the varibale on a delimiter and returns a list.

In [46]:
# example
"split the words by empty space.".split(" ")

['split', 'the', 'words', 'by', 'empty', 'space.']

In [47]:
# split on a comma
"this is a comma, split".split(",")

['this is a comma', ' split']

In [48]:
# split the Name var on the comma to identify the popular last names. The list will show a comma but only as an indicator os sep values.
chicago["Name"].str.split(",")

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32057    [ZYGADLO,   MICHAEL J]
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [51]:
# use get() with the indexe position to get the last name, the last name is the 1st position as 0
chicago["Name"].str.split(",").str.get(0).value_counts()

WILLIAMS                  293
JOHNSON                   244
SMITH                     241
BROWN                     185
JONES                     183
                         ...
CHANEY SR                   1
ONAYO                       1
TOMASZEWSKI PELLEGRINI      1
GRAZZINI                    1
STOVE                       1
Name: Name, Length: 13830, dtype: int64